Revit 2024 API
SpatialElementBoundarySubface.SpatialBoundaryElement Property
 Element that gave rise to this room face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public LinkElementId SpatialBoundaryElement { get; }
Visual Basic
Public ReadOnly Property SpatialBoundaryElement As LinkElementId
	Get
Visual C++
public:
property LinkElementId^ SpatialBoundaryElement {
	LinkElementId^ get ();
}
See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace